"""
img_path = str
label:{
    level_1:
    level_2:
    level_3:
    level_4:
}

1. 先读取原始filelist/train.txt
对每一张图片写入一个json格式，写入img_path,level_4

2. 不读取excel，手写列表判断
"""

from typing import final
import tqdm
import json

data_list = []
final_dict = {}

with open('filelist/places365_train_standard.txt') as f:
    lines = f.readlines()
    for line in lines:
        line.strip()
        level_4 = line.split()[-1]
        img_path = line.split()[0][1:]
        #TODO 需要将路径连接起来
        #TODO 在这里写入json文件

        img_dict = {}
        img_dict['img_path']=img_path
        img_dict['level_1']=-1
        img_dict['level_2']=24
        img_dict['level_3']=-1
        img_dict['level_4']=int(level_4)

        #INFO:二级指标的计算
        level_2 = dict(
        level_2_0 = [
            22,26,33,41,43,45,52,63,89,95,106,121,126,176,177,195,203,215,216,253,303,328,358,
            123,19,156,157,183,201,221,272,290,317,318,343,362
        ],
        level_2_1 = [
            56,77,88,92,202,210,296,20,100,212,264,
            14,21,37,102,108,120,132,134,211,244,246,280,298,
            23,28,93,133,155,192,282,285
        ],
        level_2_2 =[
            53,75,114,139,148,267,284,286,322,
            39,54,99,274
        ],
        level_2_3 = [
            11,269,
            31,46,47,60,72,80,96,115,137,146,147,160,162,172,198,208,222,300,301,321,335
        ],
        level_2_4 = [
            50,128,178,179,241,248,262,352,
            261,346,
            124,182,363,
            11,269,281,
            240
        ],
        level_2_5 = [
            0,1,2,98,169,170,174,293,
            278,336,337,
            57,58,59,79,171,266,277,
            55,82,158,175,231,255,256,257,
            70,71,320
        ],
        level_2_6 = [
            9,19,29,61,236,238,239,297,
            5,27,35,101,122,250,315,316,235,329
        ],
        level_2_7 = [
            6,7,34,83,268,294,353
        ],
        level_2_8 = [
            76,180,254,259,265
        ],
        level_2_9 = [
            24,276,42,149,164,
            310,
            44,
            326,325,
            351,189,304,305
        ],
        level_2_10 = [
            64,65,168,188,219,295,225
        ],
        level_2_11 = [
            15,17,16,68,275,312,313,314
        ],
        level_2_12 = [
            8,32,67,143,144,213,223,237,245,283,307,125
        ],
        level_2_13 = [
            4,112,127,161,181,185,193,263,319,332,
            25,154,260,270
        ],
        level_2_14 = [
            3,91,90,167,227,230,251,327,330,
            12,84,159,200,226,229,242,289,334,
            13,69,85
        ],
        level_2_15 = [
            66,218,291,347
        ],
        level_2_16 = [
            87,105,107,184,299,311,339,361,348,354,
            40,62,138,165,166,249,345,349
        ],
        level_2_17 = [
            109,153,197,220,333,364
        ],
        level_2_18 = [
            104,140,142,173,287,359,
            30,36,258,209,224,323,341,360
        ],
        level_2_19 = [
            116,117,118
        ],
        level_2_20 = [
            73,81,94,232,233,344,350,
            150,151,152,279,338,
            10,78,110,113,145,204,205,271,288,355,356,324
        ],
        level_2_21 = [
            48,49,97,194,214,273,342,357
        ],
        level_2_22 = [
            111,163,186,187,190,191,234,309
        ],
        level_2_23 = [
            306
        ],)

        for i in range(24):
            level = "level_2_" + str(i)
            if int(level_4) in level_2[level]:
                img_dict['level_2']=int(level[8:])

        data_list.append(img_dict)
final_dict["info"] = "Place365_train"
final_dict["image_dict"] = data_list

#INFO:写入json文件
with open('filelist/annotation_json/train.json','w') as f:
    json.dump(final_dict,f,indent=4)
        
        